export const STAGE_PIECES_TYPES = [
  ["CRAB", "GOAT", "SCORPION", "SHEEP"],
  ["FISH", "LION", "SCORPION", "TAURUS"],
  ["SCALE", "SHEEP", "GOAT", "LION"],
  ["SHEEP", "FISH", "TAURUS", "CRAB"],
  ["LION", "TAURUS", "SCORPION", "FISH"],
];

export const hintText = [
  "염소와 양이 하늘 가장 아래, 가운데에서 오른쪽으로, 게와 전갈은 하늘 가장 위, 왼쪽부터 오른쪽으로 순서대로 나란히 붙어 어울린다.",
  "하늘 한 가운데에 물고기가 있는데 왼쪽에서는 사자가 탐하고 오른쪽에서는 황소가 탐하며 아래에서는 전갈이 한마리 유유히 지나간다",
  "하늘 한 가운데 천칭이 균형을 잡고 있다. 그 하늘의 가장 높은 곳에는 사자와 염소, 양이 순서대로 나란히 서서 이 천칭을 내려다보고 있다.",
  "게와 물고기는 하늘의 가장 높은 곳의 양 끝에, 황소와 양은 하늘의 가장 낮은 곳의 양 끝에",
  "사자, 황소, 전갈이 가장 윗 줄에 순서대로, 물고기는 둘째 줄 가운데",
];

export const PUZZLE_ANSWER = [
  "130000024",
  "000214030",
  "432010000",
  "402000301",
  "123040000",
];

export const RESULT_DATE = [
  "1294년 10월 1일",
  "1866년 8월 14일",
  "1919년 2월 20일",
  "1866년 11월 1일",
  "2022년 8월 1일",
];
